Revit 2024 API
ElectricalLoadType Enumeration
 Represents the electrical load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public enum ElectricalLoadType
Visual Basic
Public Enumeration ElectricalLoadType
Visual C++
public enum class ElectricalLoadType
Members
Member name | Description
EquipmentLoad |  Equipment Load
AreaBasedLoad |  Area Based Load
See Also
Autodesk.Revit.DB.Electrical Namespace